#+title: Chun-mode
#+STARTUP: overview indent
#+OPTIONS: num:nil

Some emacs configs I used without any personal information.

Babel mode is a good place to take notes.

** STRT global mark
General idea:

1. hold a global dictionary mapping from annotation to file&lineno
2. user's interface
   - [ ] add a record to the dictionary
   - [ ] clean all the records
   - [ ] remove a record
   - [ ] jump to the line of a record
   - [X] eager update, might too hard in the begining, if new lines are inserted before, update the related lineno.

The dependencies of knowledge:

- helm for providing an interface for query the record
- associate list?


Define a structure for point


#+BEGIN_SRC emacs-lisp
(require 'cl-lib)

(cl-defstruct chun-point-mark
  ;; the filepath
  filename
  ;; point in a file
  point
  )
#+END_SRC

#+RESULTS:
: chun-point-mark

Define a global map to remember the ~chun-point-mark~ records.


#+BEGIN_SRC emacs-lisp
(require 'ht)

(setq chun-point-mark-dic
      (ht-create))
#+END_SRC

#+RESULTS:
: #s(hash-table size 65 test equal rehash-size 1.5 rehash-threshold 0.8125 data ())

Define some helper functions to get necesssary information for the point.


#+BEGIN_SRC emacs-lisp
(defun --chun-point-mark-get-point-for-current-position ()
  "Get a point-mark instance for the current position."
  (let* ((file-path (file-truename buffer-file-name))
         (new-mark (make-marker))
         (cur-point (point))
         )
    (set-marker new-mark (point))
    (make-chun-point-mark :filename file-path :point new-mark)))
#+END_SRC

#+RESULTS:
: --chun-point-mark-get-point-for-current-position


#+BEGIN_SRC emacs-lisp
(defun --chun-point-mark-goto-position (pos)
  "Go to the position a point-mark points to.
pos: chun-point-mark
"
  (let* ((file-path (chun-point-mark-filename pos))
         (the-point (chun-point-mark-point pos))
         )
    (switch-to-buffer
     (find-file-noselect file-path))
    (goto-char the-point)))
#+END_SRC

#+RESULTS:
: --chun-point-mark-goto-position


Define serveral functions to manipulating the records.

#+BEGIN_SRC emacs-lisp
(defun --chun-point-mark-get-record (key)
  "Get a point-mark record."
  (ht-get chun-point-mark-dic key)
  )
#+END_SRC

#+RESULTS:
: --chun-point-mark-get-record

#+BEGIN_SRC emacs-lisp
(defun --chun-point-mark-set-record (key instance)
  "Set or add a record in point-mark dic.
key: string
instance: chun-point-mark
"
  (ht-set! chun-point-mark-dic key instance)
  )
#+END_SRC

#+RESULTS:
: --chun-point-mark-set-record



Define some user interfaces including:

- add-point, add or update a point to the global record
  - Use a interactive to set a name to this point
- delete-point, delete a point
  - Use a helm to choose an existing record to remove
- goto-point
  - Use a helm to select an existing record to goto


#+BEGIN_SRC emacs-lisp
(defun chun-point-mark-add-current(key)
  (interactive "M")
  (let* ((cur-point
          (--chun-point-mark-get-point-for-current-position))
         )
    (--chun-point-mark-set-record key cur-point)))
#+END_SRC

#+RESULTS:
: chun-point-mark-add-current


#+BEGIN_SRC emacs-lisp
(defun chun-point-mark-goto (key)
  "Goto a point annotated by key."
  (interactive (list (helm :sources (helm-build-sync-source "keys"
                                      :candidates (ht-keys chun-point-mark-dic)
                                      :fuzzy-match t)
                           :buffer "*chun-point-mark*")))

  (let* ((the-point (--chun-point-mark-get-record key)))
    (if the-point
        (--chun-point-mark-goto-position the-point))))
#+END_SRC

#+RESULTS:
: chun-point-mark-goto


Add marks


#+BEGIN_SRC emacs-lisp
(map! :leader
      :desc "Add point mark" "pa" #'chun-point-mark-add-current)
(map! :leader
      :desc "Goto point mark" "pg" #'chun-point-mark-goto)
#+END_SRC

#+RESULTS:
: chun-point-mark-goto





*** enable execution of several languages

#+BEGIN_SRC emacs-lisp
(org-babel-do-load-languages 'org-babel-load-languages '((C . t)
                                                         (python . t)
                                                         (latex . t)
                                                         (dot . t)
                                                         ;;(jupyter . t)
                                                         ))
#+END_SRC

#+RESULTS:


#+BEGIN_SRC emacs-lisp
;;(setq ob-async-no-async-languages-alist '("python" "jupyter-python"))
#+END_SRC

#+RESULTS:
| python | jupyter-python |

* Projectile related

Set project directories.

#+BEGIN_SRC emacs-lisp
(defcustom chun-mode/projectile-dirs '()
  "The yas-snippets directory."
  :type '(restricted-sexp :tag "Vector"
                          :match-alternatives
                          (lambda (xs) (and (vectorp xs) (seq-every-p #'stringp xs))))
  :group 'chun)
#+END_SRC

#+RESULTS:
: chun-mode/projectile-dirs

Set ignored directories.

#+BEGIN_SRC emacs-lisp
(defvar chun/projectile-ignored-directories
  '("^\\.git$" "env"
    "^\\.idea$" "^cmake-build-debug$"
    "^build*$" "^cmake-build-debug-*"
    "^__pycache__$")
  "Directories to ignore")
#+END_SRC

#+RESULTS:
: chun/projectile-globally-ignored-directories


Conduct the mainloop

#+BEGIN_SRC emacs-lisp
(require 'dash)

(after! projectile
  (-map (lambda (path)
          (projectile-add-known-project path)) chun-mode/projectile-dirs)

  (setq projectile-indexing-method 'native)
  (setq projectile-generic-command
        (mapconcat #'shell-quote-argument
                   (append (list "rg" "-0" "--files" "--follow" "--color=never" "--hidden")
                           (cl-loop for dir in chun/projectile-ignored-directories collect
                                    "--glob" collect (concat "!" dir))) " ") projectile-git-command
                                    projectile-generic-command))
#+END_SRC

#+RESULTS:
: rg -0 --files --follow --color\=never --hidden --glob \!\^\\.git\$ --glob \!env --glob \!\^\\.idea\$ --glob \!\^cmake-build-debug\$ --glob \!\^build\*\$ --glob \!\^cmake-build-debug-\* --glob \!\^__pycache__\$













